formattingPattern.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-10-11 Wed 14:01 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Formatting Pattern</title>
<meta name="author" content="Nathan Stonewall" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Formatting Pattern</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org4697bd8">Problem</a></li>
<li><a href="#orgc9afefc">Current examples of styled TII</a></li>
<li><a href="#orgd699121">Suggested solution</a></li>
<li><a href="#orgfa33047">Considerations</a></li>
</ul>
</div>
</div>
<p>
 <br>
</p>
<div id="outline-container-org4697bd8" class="outline-2">
<h2 id="org4697bd8">Problem</h2>
<div class="outline-text-2" id="text-org4697bd8">
<ul class="org-ul">
<li>Community expressed need to send <b><b>styled textual information</b></b> via GDSN.</li>

<li><code>FormattedDescription</code> and <code>formattingPattern</code> provide this</li>

<li>But these are difficult to implement and use</li>

<li><p>
HTML code currently used by some datapools, but:
</p>
<ul class="org-ul">
<li>Unstandardized</li>
<li>Unsafe</li>
</ul>

<ul class="org-ul">
<li>Must be escaped/unescaped</li>
<li>Not adapted to current XML modeling</li>
</ul></li>
</ul>

<p>
 <br>
</p>
<hr />
<p>
 <br>
</p>
</div>
</div>
<div id="outline-container-orgc9afefc" class="outline-2">
<h2 id="orgc9afefc">Current examples of styled TII</h2>
<div class="outline-text-2" id="text-orgc9afefc">
</div>
<ul class="org-ul">
<li><a id="org4e02d5f"></a>TIIG framework<br />
<div class="outline-text-4" id="text-org4e02d5f">
<div class="org-src-container">
<pre class="src src-text">formattingPattern=&#8220;(1,p),(1,em),(56,/em),(141,em),(159,/em),
                   (214,em),(266,/em),(348,em),(362,/em),
                   (446,em),(456,/em),(457,/p),(459,p),
                   (459,em),(512,/em),(556,em),(578,/em),
                   (604,em),(622,/em),(969,/p)"&gt;
</pre>
</div>
</div>
</li>
<li><a id="org829d7aa"></a>HTML<br />
<div class="outline-text-4" id="text-org829d7aa">
<div class="org-src-container">
<pre class="src src-xml">&lt;<span style="color: #82aaff;">stringAVP</span> <span style="color: #ffcb6b;">attributeName</span>=<span style="color: #c3e88d;">"ingredientStatementFormattingPattern"</span>&gt;<span style="color: #F78C6C;">&amp;</span><span style="color: #F78C6C;">lt</span><span style="color: #F78C6C;">;</span>u<span style="color: #F78C6C;">&amp;</span><span style="color: #F78C6C;">gt</span><span style="color: #F78C6C;">;</span>Stuff<span style="color: #F78C6C;">&amp;</span><span style="color: #F78C6C;">lt</span><span style="color: #F78C6C;">;</span>/u<span style="color: #F78C6C;">&amp;</span><span style="color: #F78C6C;">gt</span><span style="color: #F78C6C;">;</span>&lt;/<span style="color: #82aaff;">stringAVP</span>&gt;
&lt;<span style="color: #82aaff;">stringAVP</span> <span style="color: #ffcb6b;">attributeName</span>=<span style="color: #c3e88d;">"ingredientStatementFormattingPattern"</span>&gt;stuff<span style="color: #F78C6C;">&amp;</span><span style="color: #F78C6C;">lt</span><span style="color: #F78C6C;">;</span>br<span style="color: #F78C6C;">&amp;</span><span style="color: #F78C6C;">gt</span><span style="color: #F78C6C;">;</span>Ingredients: Stuff&lt;/<span style="color: #82aaff;">stringAVP</span>&gt;
</pre>
</div>

<p>
 <br>
</p>


<p>
 <br>
</p>

<hr />
</div>
</li>
</ul>
</div>
<div id="outline-container-orgd699121" class="outline-2">
<h2 id="orgd699121">Suggested solution</h2>
<div class="outline-text-2" id="text-orgd699121">
</div>
<ul class="org-ul">
<li><a id="org8ae5b9e"></a>Implement <a href="https://en.wikipedia.org/wiki/BBCode">BBCode formatting</a> or similar <a href="https://en.wikipedia.org/wiki/Lightweight_markup_language">lightweight markup language</a>.<br />
<div class="outline-text-3" id="text-org8ae5b9e">
</div>
</li>
<li><a id="org0e56070"></a>Advantages<br />
<ul class="org-ul">
<li><a id="org9d43af0"></a>Simple<br />
<div class="outline-text-5" id="text-org9d43af0">
</div>
</li>
<li><a id="org47613cd"></a>Safe<br /></li>
<li><a id="org965881d"></a>Flexible<br /></li>
<li><a id="org0ff5b56"></a>Well-established<br /></li>
<li><a id="orge959827"></a>Simple to implement<br />
<div class="outline-text-5" id="text-orge959827">
</div>
</li>
</ul>
<li><a id="orgbad8494"></a>Syntax<br />
<div class="outline-text-4" id="text-orgbad8494">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">BBCode</th>
<th scope="col" class="org-left">Effect</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">[b]</td>
<td class="org-left">Bold</td>
</tr>

<tr>
<td class="org-left">[i]</td>
<td class="org-left">Italic</td>
</tr>

<tr>
<td class="org-left">[u]</td>
<td class="org-left">Underline</td>
</tr>

<tr>
<td class="org-left">[br]</td>
<td class="org-left">Line break</td>
</tr>

<tr>
<td class="org-left">[url]</td>
<td class="org-left">Insert link</td>
</tr>

<tr>
<td class="org-left">[color=color]</td>
<td class="org-left">Change text color to {color}</td>
</tr>

<tr>
<td class="org-left">[align=alignment]</td>
<td class="org-left">Align text e.g. to center</td>
</tr>

<tr>
<td class="org-left">[list]</td>
<td class="org-left">Make list</td>
</tr>

<tr>
<td class="org-left">[*]</td>
<td class="org-left">Add list item</td>
</tr>
</tbody>
</table>
</div>
</li>
<li><a id="org6a38cbc"></a>Example BBCode<br />
<div class="outline-text-4" id="text-org6a38cbc">
<div class="org-src-container">
<pre class="src src-text">[b]4 X Flamin&#8217; Hot Flavour Baked Corn Snack. Ingredients: [/b]Maize,
   Vegetable Oil, Flamin Hot Flavour [b]Hydrolysed Soya Protein[/b],
   [i]Fructose[/i], Flavourings ...
</pre>
</div>

<p>
 <br>
</p>
</div>
</li>
</ul>
</li>
<li><a id="org35b765a"></a>Suggested process:<br />
<ul class="org-ul">
<li><a id="org92fd4c8"></a>Service providers implement rich-text editors in their GUIs, or &#x2026;<br /></li>
<li><a id="orgd6433be"></a>End users fill in TII, by hand.<br /></li>
<li><a id="orgeab2aa8"></a>DP forwards TII to recipient<br /></li>
<li><a id="org5d11a3f"></a>Recipient decides how or whether to handle styled TII.<br />
<div class="outline-text-6" id="text-org5d11a3f">
<p>
 <br>
</p>
</div>
</li>
</ul>
</li>
</ul>
</div>
<div id="outline-container-orgfa33047" class="outline-2">
<h2 id="orgfa33047">Considerations</h2>
<div class="outline-text-2" id="text-orgfa33047">
</div>
<ul class="org-ul">
<li><a id="orgc2c26ee"></a>Limit complexity → Agree on allowed subset of BBCode?<br /></li>
<li><a id="orge9fe80b"></a>Modeling         → Replace <code>formattingPattern</code>, <code>sequenceNumber</code>?<br /></li>
<li><a id="orgd81aea5"></a>Validations      → For all styled text, ensure recipients get same text unstyled?<br />
<div class="outline-text-6" id="text-orgd81aea5">
<p>
 <br>
</p>
</div>
</li>
</ul>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2023-10-05 Thu 00:00</p>
<p class="author">Author: Nathan Stonewall</p>
<p class="date">Created: 2023-10-11 Wed 14:01</p>
</div>
</body>
</html>